; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	infrared1 - mode
	thermograph0 - mode
	spectrograph2 - mode
	Star1 - direction
	GroundStation11 - direction
	Star12 - direction
	GroundStation13 - direction
	Star5 - direction
	Star8 - direction
	Star9 - direction
	Star14 - direction
	GroundStation4 - direction
	GroundStation0 - direction
	Star3 - direction
	GroundStation10 - direction
	GroundStation6 - direction
	GroundStation2 - direction
	GroundStation7 - direction
	Planet15 - direction
	Star16 - direction
	Phenomenon17 - direction
	Planet18 - direction
	Planet19 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 GroundStation10)
	(calibration_target instrument0 Star8)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 GroundStation6)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation7)
	(calibration_target instrument1 GroundStation4)
	(calibration_target instrument1 Star9)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star14)
	(supports instrument2 spectrograph2)
	(supports instrument2 infrared1)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation10)
	(calibration_target instrument2 Star14)
	(supports instrument3 spectrograph2)
	(supports instrument3 thermograph0)
	(supports instrument3 infrared1)
	(calibration_target instrument3 GroundStation0)
	(calibration_target instrument3 Star3)
	(calibration_target instrument3 GroundStation4)
	(supports instrument4 thermograph0)
	(supports instrument4 spectrograph2)
	(calibration_target instrument4 GroundStation7)
	(calibration_target instrument4 GroundStation2)
	(calibration_target instrument4 GroundStation6)
	(calibration_target instrument4 GroundStation10)
	(calibration_target instrument4 Star3)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
)
(:goal (and
	(have_image Planet15 spectrograph2)
	(have_image Star16 thermograph0)
	(have_image Phenomenon17 thermograph0)
	(have_image Planet18 infrared1)
	(have_image Planet19 infrared1)
))

)

; plan
1. (turn_to satellite1 groundstation10 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 groundstation10)
   goals met: 0 of 5
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 5
3. (calibrate satellite1 instrument2 groundstation10)
   added: (calibrated instrument2)
   goals met: 0 of 5
4. (turn_to satellite1 planet18 groundstation10)
   deleted: (pointing satellite1 groundstation10)
   added: (pointing satellite1 planet18)
   goals met: 0 of 5
5. (take_image satellite1 planet18 instrument2 infrared1)
   added: (have_image planet18 infrared1)
   goals met: 1 of 5
6. (turn_to satellite1 planet15 planet18)
   deleted: (pointing satellite1 planet18)
   added: (pointing satellite1 planet15)
   goals met: 1 of 5
7. (take_image satellite1 planet15 instrument2 spectrograph2)
   added: (have_image planet15 spectrograph2)
   goals met: 2 of 5
8. (turn_to satellite1 phenomenon17 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 phenomenon17)
   goals met: 2 of 5
9. (take_image satellite1 phenomenon17 instrument2 thermograph0)
   added: (have_image phenomenon17 thermograph0)
   goals met: 3 of 5
10. (turn_to satellite1 planet19 phenomenon17)
   deleted: (pointing satellite1 phenomenon17)
   added: (pointing satellite1 planet19)
   goals met: 3 of 5
11. (take_image satellite1 planet19 instrument2 infrared1)
   added: (have_image planet19 infrared1)
   goals met: 4 of 5
12. (turn_to satellite1 star16 planet19)
   deleted: (pointing satellite1 planet19)
   added: (pointing satellite1 star16)
   goals met: 4 of 5
13. (take_image satellite1 star16 instrument2 thermograph0)
   added: (have_image star16 thermograph0)
   goals met: 5 of 5
